Config/Catalogs/ПравилаЗаполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаЗаполнения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнениеСНастройками</Name>
					<Comment>При заполнении отчета всегда выводится форма настроек заполнения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяОбработкаДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МетодОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметры</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполнятьПриЗаполнении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьВМенюЗаполнения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметров</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеВИнтерфейсе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменяетсяВНастройкеЗаполнения</Name>
							<Comment>Если Истина, отображается в форме "Настройка заполнения" и "Заполнение по документу основанию"</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезПодтверждения</Name>
							<Comment>Если "ОтображатьВМенюЗаполнения" = Истина, то при нажатии на команду в отчете, если "БезПодтверждения" = Истина, не будет открываться окно настроек.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстПодсказки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КартыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТаблицаДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбщиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательскаяДоступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадаетсяСпискомЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ПоказателиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПоказателиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИтога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИтоговПоказателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаскрытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРаскрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФинансовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеМасштабируется</Name>
					<Comment>Точность отображения показателя не зависит от точности отображения документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеограниченнаяДлина</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПромежуточныеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньТочностиПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальнаяТочность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/КолонкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КолонкиОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗначенийПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбработкиПоказателейОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/CommonModules/ЗаполнениеОтчетностиСерверПовтИсп/Ext/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// БЮДЖЕТНАЯ ОТЧЕТНОСТЬ, ПРОЦЕДУРЫ И ФУНКЦИИ ПОВТОРНОГО ИСПОЛЬЗОВАНИЯ          //
/////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Получает значение поля по ключу в карте данных
//
// Параметры:
//  АдресКартыДанных - Карта данных для поиска
//  СтрокаРесурса - Имя поля ресурса, значение которого возвращается
//  ЗначениеПоУмолчанию - значение возвращаемое если строка не найдена
//  СтрокаИзмерений - Строка имен полей с разделителями "," определяющая ключ поиска
//  Значение1 - Значение первого измерения
//  ...
//  Значение10 - Значение десятого измерения
//
// Возвращаемое значение:
//  Значение ресурса, если строка найдена по ключу "Строка ресурса"
//  ЗначениеПоУмолчанию - если строка с указанным ключем не найдена
//
Функция НайтиВКартеДанных(АдресКартыДанных, СтрокаРесурса, ЗначениеПоУмолчанию = Неопределено, СтрокаИзмерений, Значение1 = Неопределено,
								Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено, Значение5 = Неопределено,
								Значение6 = Неопределено, Значение7 = Неопределено, Значение8 = Неопределено, Значение9 = Неопределено, Значение10 = Неопределено) Экспорт
								
	Перем КартаДанных;
	Перем ПараметрыПоиска;
	Перем МассивИзмерений;
	Перем НайденныеСтроки;
	Перем НайденноеЗначение;
	
	КартаДанных = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьИзВременногоХранилищаПовтИсп(АдресКартыДанных);
	
	Если ТипЗнч(КартаДанных) <> Тип("ТаблицаЗначений") Тогда
		
		ТекстОшибки = НСтр("ru = 'Не удалось получить значение карты данных при вычислении значения вычисляемого поля'");
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура;
	
	МассивИзмерений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаИзмерений);
	КоличествоИзмерений = ?(МассивИзмерений.Количество() > 10, 10, МассивИзмерений.Количество());
	
	СтруктураЗИ = Новый Структура("Значение1,Значение2,Значение3,Значение4,Значение5,Значение6,Значение7,Значение8,Значение9,Значение10",
		Значение1,Значение2,Значение3,Значение4,Значение5,Значение6,Значение7,Значение8,Значение9,Значение10);							
	
	Для ном = 1 По КоличествоИзмерений Цикл
		
		ПараметрыПоиска.Вставить(МассивИзмерений[ном - 1], СтруктураЗИ["Значение"+ном]);
		
	КонецЦикла;
	
	НайденныеСтроки = КартаДанных.НайтиСтроки(ПараметрыПоиска);
	
	НайденноеЗначение = ЗначениеПоУмолчанию;
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НайденноеЗначение = НайденныеСтроки[0][СтрокаРесурса];
		
	КонецЕсли;
	
	Возврат НайденноеЗначение;
	
КонецФункции

// Получает таблицу плана счетов в которой каждому счету соответствует родительский счет с учетом всей иерархии
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Таблица значений с колонками:
//     Ссылка - Ссылка на счет
//     Родитель - Ссылка на родительский счет, если счет первого уровня, то ссылка на счет
//
Функция ПолучитьИерархиюПланаСчетов() Экспорт
	
	Возврат ЗаполнениеОтчетностиСервер.ПолучитьИерархиюПланаСчетов();
	
КонецФункции

// Получает описание доступных в системе видов исходных таблиц
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Список значений, значение - имя макета, представление - синоним макета
//
Функция ПолучитьВидыТаблиц() Экспорт
	
	Результат = Новый Соответствие;
		
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Проводки без аналитики'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_Движения";
	Результат.Вставить("Движения",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Проводки с аналитикой'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ДвиженияССубконто";
	Результат.Вставить("ДвиженияССубконто",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Обороты счета'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_Обороты";
	Результат.Вставить("Обороты",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Обороты счета Дт/Кт'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ОборотыДтКт";
	Результат.Вставить("ОборотыДтКт",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Остатки по счету'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_Остатки";
	Результат.Вставить("Остатки",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Остатки и обороты'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ОстаткиИОбороты";
	Результат.Вставить("ОстаткиИОбороты",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Показатели плана'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ПоказателиПлана";
	Результат.Вставить("ПоказателиПлана",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Данные других отчетов'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ПоказателиОтчетов";
	Результат.Вставить("ПоказателиОтчетов",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Дебиторская задолженность (авансы)'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ДебЗадолженность";
	Результат.Вставить("ДебЗадолженность",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстатки";
	Результат.Вставить("РазвернутыеОстатки",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки (с КЭК) по видам счетов ИО'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстаткиКЭКПоВидамСчетовИО";
	Результат.Вставить("РазвернутыеОстаткиКЭКПоВидамСчетовИО",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки (с КЭК) по кодам причин ИО'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстаткиКЭКПоКодамПричинИО";
	Результат.Вставить("РазвернутыеОстаткиКЭКПоКодамПричинИО",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки (с КЭК)'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстаткиКЭК";
	Результат.Вставить("РазвернутыеОстаткиКЭК",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки и обороты ден. и неден. счетов'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстаткиИОборотыДенНеденСчетов";
	Результат.Вставить("РазвернутыеОстаткиИОборотыДенНеденСчетов",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки и обороты ден. и неден. счетов (с КЭК)'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстИОбКЭК";
	Результат.Вставить("РазвернутыеОстИОбКЭК",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки и обороты по сегментам (с КЭК)'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстИОбКЭКСегменты";
	Результат.Вставить("РазвернутыеОстИОбКЭКСегменты",ОписаниеТаблицы);
		
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Сведения о долгосрочной задолженности'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_Долгосрочная";
	Результат.Вставить("Долгосрочная",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Сведения о долгосрочной задолженности (c КЭК)'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ДолгосрочнаяКЭК";
	Результат.Вставить("ДолгосрочнаяКЭК",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Задолженность по срокам исполнения'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ЗадолженностьПоСрокамИсполнения";
	Результат.Вставить("ЗадолженностьПоСрокамИсполнения",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Сведения о просроченной задолженности'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_Просроченная";
	Результат.Вставить("Просроченная",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Сведения о просроченной задолженности (с КЭК)'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ПросроченнаяКЭК";
	Результат.Вставить("ПросроченнаяКЭК",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Обороты счетов 109 (для 110/710)'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_Обороты109";
	Результат.Вставить("Обороты109",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Сведения об исполнении обязательств'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ИсполнениеОбязательств";
	Результат.Вставить("ИсполнениеОбязательств",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Развернутые остатки (с КЭК) на дату'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_РазвернутыеОстаткиКЭКНаДату";
	Результат.Вставить("РазвернутыеОстаткиКЭКНаДату",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Для вывода карты данных'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ДляВыводаКартыДанных";
	Результат.Вставить("ДляВыводаКартыДанных",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Данные для ф. 190/790'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ДанныеДля190_790";
	Результат.Вставить("ДанныеДля190_790",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Сведения о долгосрочных активах'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ДолгосрочныеАктивы";
	Результат.Вставить("ДолгосрочныеАктивы",ОписаниеТаблицы);
	
	ОписаниеТаблицы = Новый Структура("Представление,ПолноеИмяМакета");
	ОписаниеТаблицы.Представление = НСтр("ru = 'Дата возн.дт.задолж. для ф.192'");
	ОписаниеТаблицы.ПолноеИмяМакета = "ЗаполнениеОтчетов_ВозникновениеДтЗадолженности";
	Результат.Вставить("ВозникновениеДтЗадолженности",ОписаниеТаблицы);
	
	ЗаполнениеОтчетностиСерверПереопределяемый.ПолучитьВидыТаблиц(Результат);
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Получает массив вызовов общих модулей для данной конфигурации
// Вызовы вида: <ИмяОбщегоМодуля> + "."
//
// Параметры:
//  Сервер, ВнешнееСоединение, ВызовСервера, КлиентОбычноеПриложение,
//  КлиентУправляемоеПриложение, Глобальный, Привилегированный,
//  ПовторноеИспользованиеВозвращаемыхЗначений - флаги общего модуля
//
// Возвращаемое значение:
//  Массив вызовов
//
Функция ПолучитьВызовыОбщихМодулей(Знач Сервер = Неопределено,
								   Знач ВнешнееСоединение = Неопределено, 
								   Знач ВызовСервера = Неопределено, 
								   Знач КлиентОбычноеПриложение = Неопределено, 
								   Знач КлиентУправляемоеПриложение = Неопределено, 
								   Знач Глобальный = Неопределено, 
								   Знач Привилегированный = Неопределено, 
								   Знач ПовторноеИспользованиеВозвращаемыхЗначений = Неопределено,
								   ТолькоЗапрещенные = Ложь) Экспорт
	
	МассивВызовов = Новый Массив;
	
	РазрешенныеМодули = ПолучитьРазрешенныеВызовыОбщихМодулей();
	
	Для каждого ОбщийМодуль Из Метаданные.ОбщиеМодули Цикл
		
		ВключатьВВыборку = Истина;
		
		Если ТипЗнч(Сервер) = Тип("Булево") И ОбщийМодуль.Сервер <> Сервер Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ВнешнееСоединение) = Тип("Булево") И ОбщийМодуль.ВнешнееСоединение <> ВнешнееСоединение Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ВызовСервера) = Тип("Булево") И ОбщийМодуль.ВызовСервера <> ВызовСервера Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(КлиентОбычноеПриложение) = Тип("Булево") И ОбщийМодуль.КлиентОбычноеПриложение <> КлиентОбычноеПриложение Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(КлиентУправляемоеПриложение) = Тип("Булево") И ОбщийМодуль.КлиентУправляемоеПриложение <> КлиентУправляемоеПриложение Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Глобальный) = Тип("Булево") И ОбщийМодуль.Глобальный <> Глобальный Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Привилегированный) = Тип("Булево") И ОбщийМодуль.Привилегированный <> Привилегированный Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ПовторноеИспользованиеВозвращаемыхЗначений) = Тип("Булево") И ОбщийМодуль.ПовторноеИспользованиеВозвращаемыхЗначений <> ПовторноеИспользованиеВозвращаемыхЗначений Тогда
			ВключатьВВыборку = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ТолькоЗапрещенные = Истина Тогда
			
			Если РазрешенныеМодули.Найти(НРег(ОбщийМодуль.Имя)+".") <> Неопределено Тогда
				ВключатьВВыборку = Ложь;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ВключатьВВыборку Тогда
			МассивВызовов.Добавить(НРег(ОбщийМодуль.Имя)+".");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивВызовов;
	
КонецФункции

функция ПолучитьРазрешенныеВызовыОбщихМодулей() Экспорт 
	
	Результат = Новый Массив;
	
	Результат.Добавить(НРег("ЗаполнениеОтчетности."));
	Результат.Добавить(НРег("СтроковыеФункцииКлиентСервер."));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМинимальнуюДлинуВызова() Экспорт
	
	ВызовыОМ = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьВызовыОбщихМодулей();	
	
	МинимальнаяДлинаВызова = 1000;
	
	Для каждого ТекстВызова Из ВызовыОМ Цикл
			
		МинимальнаяДлинаВызова = Мин(МинимальнаяДлинаВызова, СтрДлина(ТекстВызова));
		
	КонецЦикла;
	
	Если МинимальнаяДлинаВызова = 1000 Тогда
		МинимальнаяДлинаВызова = 1;
	КонецЕсли;
	
	Возврат МинимальнаяДлинаВызова;
	
КонецФункции

// Получает дерево функций для вычисляемых полей и массив разрешенных вызовов общих модулей из шаблона
//
// Параметры:
//  ИмяМакета - Макет содержащий описание методов в виде DOM-модели
//
// Возвращаемое значение:
//  Структура содержащая ДеревоМетодов и МассивРазрешенныхВызовов
//
Функция ПолучитьДеревоМетодов(ИмяМакета) Экспорт
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	ДеревоЗначений = Новый ДеревоЗначений;
	
	ДеревоЗначений.Колонки.Добавить("Наименование",ТипСтрока,"Наименование");
	ДеревоЗначений.Колонки.Добавить("Шаблон",ТипСтрока,"Шаблон");
	ДеревоЗначений.Колонки.Добавить("Подсказка",ТипСтрока,"Подсказка");
	ДеревоЗначений.Колонки.Добавить("Уровень",ТипЧисло,"Уровень");
	
	МассивРазрешенныхВызовов = Новый Массив;
	
	ТекстСправки = Справочники.ПравилаЗаполнения.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстСправки);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	Для каждого Раздел Из ДокументDOM.ПервыйДочерний.ДочерниеУзлы Цикл
		
		СтрокаДереваРаздел = ДеревоЗначений.Строки.Добавить();
		СтрокаДереваРаздел.Наименование = Раздел.Атрибуты.ПолучитьИменованныйЭлемент("Заголовок").Значение;
		СтрокаДереваРаздел.Уровень = 0;
		
		Для каждого Подраздел Из Раздел.ДочерниеУзлы Цикл
			
			СтрокаДереваПодраздел = СтрокаДереваРаздел.Строки.Добавить();
			СтрокаДереваПодраздел.Наименование = Подраздел.Атрибуты.ПолучитьИменованныйЭлемент("Заголовок").Значение;
			СтрокаДереваПодраздел.Уровень = 0;
			
			Для каждого Метод Из Подраздел.ДочерниеУзлы Цикл
				
				СтрокаДереваМетод = СтрокаДереваПодраздел.Строки.Добавить();
				СтрокаДереваМетод.Наименование = Метод.Атрибуты.ПолучитьИменованныйЭлемент("Имя").Значение;
				СтрокаДереваМетод.Шаблон = Метод.Атрибуты.ПолучитьИменованныйЭлемент("Шаблон").Значение;
				СтрокаДереваМетод.Подсказка = Метод.ПервыйДочерний.ТекстовоеСодержимое;
				СтрокаДереваМетод.Уровень = 3;
				
				Если СтрокаДереваРаздел.Наименование = "Функции общих модулей" Тогда
					
					ТекстВызова = СтрокаДереваМетод.Шаблон;
					Поз = Найти(ТекстВызова,"(");
					
					Если Поз <> 0 Тогда
						ПолноеИмяМетода = СокрЛП(Сред(СтрокаДереваМетод.Шаблон,1,Поз-1));
						Если НЕ ПустаяСтрока(ПолноеИмяМетода) Тогда
							МассивРазрешенныхВызовов.Добавить(НРег(ПолноеИмяМетода));
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДеревоМетодов", ДеревоЗначений);
	СтруктураВозврата.Вставить("МассивРазрешенныхВызовов", МассивРазрешенныхВызовов);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Получает из хранилища значений карту данных по адресу
//
// Параметры:
//  АдресХранилища - Строка, содержащая адрес во временном хранилище
//
// Возвращаемое значение:
//  Значение полученное из временного хранилища
//
Функция ПолучитьИзВременногоХранилищаПовтИсп(АдресХранилища) Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		
		Возврат ПолучитьИзВременногоХранилища(АдресХранилища);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции // ПолучитьИзВременногоХранилищаПовтИсп()

// Получает имя объекта метаданных по типу переданного значения
//
// Параметры:
//  Значение - значение, для которого надо получить имя объекта метаданных
//           - Допустимы только примитивные типы, ссылки, Структура или Неопределено
//
// Возвращаемое значение:
//  Строка, имя объекта метаданных
//
Функция ПолучитьИмяОбъектаМетаданных(Знач Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Неопределено") Тогда
		
		Возврат "";
		
	Иначе
		
		ИмяОбъекта = ЗаполнениеОтчетности.ВернутьСтрокуТипаПоТипу(ТипЗначения,"Запрос");
		
		Поз = Найти(ИмяОбъекта, ".");
		Если Поз = 0 Тогда
			
			Возврат ИмяОбъекта;
			
		Иначе
			
			Возврат Сред(ИмяОбъекта, Поз + 1);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Получает таблицу колонок указанного вида отчета с опциональным отбором по типу
//
// Параметры:
//  ВидОтчета - Ссылка на вид отчета
//  ТипЗначения - Тип значения показателя
//	ГруппаРаскрытия - Группа раскрытия, в которой нужно найти колонку
//
// Возвращаемое значение:
//  Таблица значений, содержащая колонки вида отчета с полями: Код, Представление, ПорядковыйНомер
//
Функция ПолучитьКолонкиВидаОтчета(Знач ВидОтчета, Знач ТипЗначения = Неопределено, Знач ГруппаРаскрытия = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КолонкиОтчетов.Код,
		|	КолонкиОтчетов.Представление,
		|	КолонкиОтчетов.ПорядковыйНомер
		|ИЗ
		|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КолонкиОтчетов КАК КолонкиОтчетов
		|		ПО ПоказателиОтчетов.Колонка = КолонкиОтчетов.Ссылка
		|			И (ПоказателиОтчетов.Владелец = &ВидОтчета)
		|			%1
		|			%2
		|
		|УПОРЯДОЧИТЬ ПО
		|	КолонкиОтчетов.ПорядковыйНомер,
		|	КолонкиОтчетов.Код";
		
	УсловиеТипЗначения = "";	
	Если НЕ ТипЗначения = Неопределено Тогда
		
		Запрос.УстановитьПараметр("ТипЗначения", ТипЗначения);
		УсловиеТипЗначения = "И (ПоказателиОтчетов.ТипЗначения = &ТипЗначения)";
		
	КонецЕсли;
	
	УсловиеГруппаРаскрытия = "";
	Если НЕ ГруппаРаскрытия = Неопределено Тогда
		
		Запрос.УстановитьПараметр("ГруппаРаскрытия", ГруппаРаскрытия);
		УсловиеГруппаРаскрытия = "И (ПоказателиОтчетов.ГруппаРаскрытия = &ГруппаРаскрытия)";
		
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Запрос.Текст, УсловиеТипЗначения, УсловиеГруппаРаскрытия);
	
	Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получает таблицу настроек расшифровки стандартными отчетами
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Таблица значений, содержащая настройки для расшифровки
//
Функция ПолучитьНастройкиРасшифровки() Экспорт
	
	Макет = Обработки.ОбработкаДанныхОтчетности.ПолучитьМакет("СтандартныеОтчетыДляРасшифровки");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Макет.ПолучитьТекст());
	
	ТаблицаДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("ТаблицаЗначений"));
	Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
		
		Возврат ТаблицаДанных;
		
	Иначе
		
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
	
КонецФункции

// Получает синоним макета шаблона запроса по его имени
//
// нужно помнить что в Макете возвращается ссылка на скд в озу а не новое значение   
// Параметры:
//  ВидТаблицы - Строка, имя макета
//
// Возвращаемое значение:
//  Строка, синоним макета
//
Функция ПолучитьИнформациюОВидеТаблицы(ВидТаблицы) Экспорт
	
	Результат = Новый Структура("Имя,Представление,ПолноеИмяМакета");
	
	ВидыТаблиц = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьВидыТаблиц();
	ОписаниеТаблицы = ВидыТаблиц.Получить(ВидТаблицы);
	
	Если ОписаниеТаблицы = Неопределено Тогда 
		Шаблон = НСтр(
		"ru = 'В системе отсутствует макет СКД для таблицы ""%1"".'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ВидТаблицы);
		
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
	Результат.Имя = ВидТаблицы;
	ЗаполнитьЗначенияСвойств(Результат,ОписаниеТаблицы,"Представление,ПолноеИмяМакета");
	
	Возврат Новый ФиксированнаяСтруктура(Результат); 
	
КонецФункции

// Получает список доступных типов данных доступных для общих параметров правила заполнения
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Список значение - содержит доступные типы данных
//
Функция ПолучитьСписокДоступныхТиповДанных() Экспорт
	
	ТипСтрока = Новый ОписаниеТипов("Строка", ,
				Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная));
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.ТипЗначения = ТипСтрока;
	
	СписокВыбора.Добавить("Булево");
	СписокВыбора.Добавить("Дата");
	СписокВыбора.Добавить("Строка");
	СписокВыбора.Добавить("Число");
	
	// Заполняем все типы из плана видов характеристик "АналитикаОтчетов"
	// Значения данных типов будут созданы автоматически при обмене правилами
	Для каждого Тип Из Метаданные.ПланыВидовХарактеристик.АналитикаОтчетов.Тип.Типы() Цикл
		
		ТипСтрокой = ЗаполнениеОтчетности.ВернутьСтрокуТипаПоТипу(Тип, "Запрос");
		
		Если СписокВыбора.НайтиПоЗначению(ТипСтрокой) = Неопределено Тогда
			
			СписокВыбора.Добавить(ТипСтрокой, Строка(Тип));
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполняем все типы перечислений
	// Значения данных типов будут созданы автоматически при обмене правилами
	Для каждого ОбъектМД Из Метаданные.Перечисления Цикл
		
		ТипСтрокой = "Перечисление."+ОбъектМД.Имя;
		
		Если СписокВыбора.НайтиПоЗначению(ТипСтрокой) = Неопределено Тогда
			
			СписокВыбора.Добавить(ТипСтрокой, ОбъектМД.Синоним);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавляем необходимые типы (список может дополняться)
	// Значения данных типов будут созданы автоматически при обмене правилами
	МассивДополнительныхТипов = Новый Массив;
	
	ЗаполнениеОтчетностиСерверПереопределяемый.ДополнитьСписокДоступныхТиповДанных(МассивДополнительныхТипов);
	//МассивДополнительныхТипов.Добавить(Тип("СправочникСсылка.РазделыЛицевыхСчетов"));
	
	Для каждого ДополнительныйТип Из МассивДополнительныхТипов Цикл
		
		ТипСтрокой = ЗаполнениеОтчетности.ВернутьСтрокуТипаПоТипу(ДополнительныйТип, "Запрос");
		
		ОбъектМД = Метаданные.НайтиПоТипу(ДополнительныйТип);
		Если ОбъектМД = Неопределено Тогда
			
			Поз = Найти(ТипСтрокой,".");
			Если Поз = 0 Тогда
				ИмяОбъекта = ТипСтрокой;
			Иначе
				ИмяОбъекта = Сред(ТипСтрокой, Поз + 1);
			КонецЕсли;
			
			Представление = БюджетнаяОтчетностьКлиентСервер.Синоним(ИмяОбъекта);
			
		Иначе
			
			Представление = ОбъектМД.Синоним;
			
		КонецЕсли;
		
		Если СписокВыбора.НайтиПоЗначению(ТипСтрокой) = Неопределено Тогда
			
			СписокВыбора.Добавить(ТипСтрокой, Представление);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

// Получает методы дополнительной обработки доступные для применения в правилах заполнения
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  ТаблицаМетодов - Таблица значений, содержащая описание методов дополнительной обработки.
//	Колонки:
//		ИмяМетода - Строка
//		Представление - Строка
//		Параметры - Строка, перечисление имен параметров разделенных символом ","
//		ХранимыеПараметры - таблица значений, описавает параметры метода, необходима для выполнения функций обмена
//
Функция ПолучитьСписокМетодовДополнительнойОбработки() Экспорт
	
	ОбработкаОбъект = Обработки.ОбработкаДанныхОтчетности.Создать();
	Возврат ОбработкаОбъект.ПолучитьМетодыДополнительнойОбработки();
	
КонецФункции

// Получает таблицу соответствия видов субконто
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Таблица значений
//
Функция ПолучитьТаблицуСоответствияВидовСубконто() Экспорт
	
	Макет = Обработки.ОбработкаДанныхОтчетности.ПолучитьМакет("ТаблицаСоответствияВидовСубконто");
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(Макет.ПолучитьТекст());
	БуферОбмена = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	ТаблицаМакета = СериализаторXDTO.ПрочитатьXDTO(БуферОбмена);
	ТаблицаМакета.Индексы.Добавить("ИмяПредопределенногоБГУ1");
	
	Возврат ТаблицаМакета;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
